app/controllers/application_controller.rb

        def authorize_request
          header = request.headers['Authorization']
          header = header.split(' ').last if header
          begin
            @decoded = JsonWebToken.decode(header)
            @current_user = User.find(@decoded[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]