app/controllers/cities_controller.rb

  def index
    @cities = if params[:name]
                City.find_by_name(params[:name])
              elsif params[:continent]
                @cities = City.all.where(continent: params[:continent])
              else
                City.all
---
SELECT "cities".* FROM "cities" WHERE "cities"."deleted_at" IS NULL AND "cities"."name" = ? LIMIT ?  [["name", "Paris"], ["LIMIT", 1]]
SELECT "cities".* FROM "cities" WHERE "cities"."deleted_at" IS NULL AND "cities"."continent_id" = ?  [["continent_id", 1]]
SELECT "cities".* FROM "cities" WHERE "cities"."deleted_at" IS NULL

    def set_city
      @city = City.find(params[:id])
---
SELECT "cities".* FROM "cities" WHERE "cities"."deleted_at" IS NULL AND "cities"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]