app/controllers/icons_controller.rb

  def index
    @icons = if params[:name]
               Icon.find_by_name(params[:name])
             elsif params[:created]
               Icon.find_by_created(params[:created])
             elsif params[:cities]
               Icon.where(id: IconCity.select([:icon_id]).where(city_id: params[:cities]))
             else
               @icons = Icon.all
---
SELECT "icons".* FROM "icons" WHERE "icons"."deleted_at" IS NULL

  def create
    @icon = Icon.new(icon_params)

    if @icon.save
      @icon.save_cities
---
INSERT INTO "icons" ("name", "created", "height", "history", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
INSERT INTO "icon_cities" ("icon_id", "city_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["icon_id", 1], ["city_id", 1], ["created_at", "2021-07-31 07:25:51.813472"], ["updated_at", "2021-07-31 07:25:51.813472"]]
INSERT INTO "icons" ("name", "image", "created", "height", "history", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
    if @icon.update(icon_params)
---
UPDATE "icons" SET "updated_at" = ? WHERE "icons"."id" = ?  [["updated_at", "2021-08-05 01:56:07.204101"], ["id", 2]]

    def set_icon
      @icon = Icon.find(params[:id])
---
SELECT "icons".* FROM "icons" WHERE "icons"."deleted_at" IS NULL AND "icons"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]