app/controllers/users_controller.rb

INSERT INTO "users" ("email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?)
---
  def register
    @user = User.new(user_params)
    if @user.save

SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "juan@gmail.com"], ["LIMIT", 1]]
---
  def login
    @user = User.find_by_email(params[:email])