app/models/icon.rb

    def save_cities
        cities_array = cities_ids.split(",")
        cities_array.each do |city_id|
            IconCity.create(icon: self, city_id: city_id)
---
INSERT INTO "icon_cities" ("icon_id", "city_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["icon_id", 1], ["city_id", 1], ["created_at", "2021-07-31 07:25:51.813472"], ["updated_at", "2021-07-31 07:25:51.813472"]]